spec/vcr/CallCredit_search/when_a_query_is_submitted_should_return_the_results.yml

---
http_interactions:
- request:
    method: post
    uri: https://ct.callcreditsecure.co.uk/Services/CallReport/callreport7.asmx
    body:
      encoding: US-ASCII
      string: ! "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"
        xmlns:soap=\"urn:callcredit.co.uk/soap:callreport7\">\n  <soapenv:Header>\n
        \   <soap:callcreditheaders>\n      <soap:company>Rentify CR CTEST</soap:company>\n
        \     <soap:username>Rentify API CR CTEST</soap:username>\n      <soap:password>lequ1li8di</soap:password>\n
        \   </soap:callcreditheaders>\n  </soapenv:Header>\n  <soapenv:Body>\n    <soap:Search07a>\n
        \ <soap:SearchDefinition>\n    <soap:creditrequest schemaversion=\"7.0\" datasets=\"255\">\n
        \     <soap:applicant><soap:address>\n  <soap:buildingno>7</soap:buildingno>\n
        \ <soap:postcode>W1</soap:postcode>\n</soap:address><soap:name>\n  <soap:forename>Julia</soap:forename>\n
        \ <soap:surname>Audi</soap:surname>\n</soap:name><soap:dob>1943-03-06</soap:dob><soap:hho>0</soap:hho><soap:tpoptout>1</soap:tpoptout><soap:applicantdemographics>\n
        \ <soap:employment/>\n</soap:applicantdemographics></soap:applicant>\n    <soap:score>1</soap:score><soap:purpose>TV</soap:purpose><soap:autosearch>1</soap:autosearch><soap:autosearchmaximum>3</soap:autosearchmaximum></soap:creditrequest>\n
        \ </soap:SearchDefinition>\n</soap:Search07a>\n  </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Soapaction:
      - ! '"urn:callcredit.co.uk/soap:callreport7/Search07a"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1167'
      Accept:
      - ! '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 25 Jul 2013 08:05:25 GMT
      Cache-Control:
      - private, max-age=0
      Content-Type:
      - text/xml; charset=utf-8
      Connection:
      - close
      Transfer-Encoding:
      - chunked
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Search07aResponse
        xmlns="urn:callcredit.co.uk/soap:callreport7"><SearchResult><jobdetails><searchid>{387E953D-3539-4D3F-ADE9-273E7CD158DE}</searchid><cast>01.01.7.1.4.1.41389.13971446.260240</cast><pstv>13971446</pstv><ls>41389</ls><searchdate>2013-07-25T09:05:09</searchdate></jobdetails><creditrequest
        schemaversion="7.0" datasets="255"><applicant><address><buildingno>7</buildingno><postcode>W1</postcode></address><name><forename>Julia</forename><surname>Audi</surname></name><dob>1943-03-06</dob><hho>0</hho><tpoptout>1</tpoptout><applicantdemographics><employment
        /></applicantdemographics></applicant><score>1</score><purpose>TV</purpose><autosearch>1</autosearch><autosearchmaximum>3</autosearchmaximum></creditrequest><picklist
        maxaddressitems="20" maxnameitems="9" picklist="1" regenerated="0"><applicant
        id="1" reporttype="0"><address addressid="1"><addressinput><abodeno /><buildingno>7</buildingno><buildingname
        /><street1 /><street2 /><sublocality /><locality /><posttown /><postcode>W1</postcode></addressinput><fullmatches
        reporttype="0" /></address></applicant></picklist><creditreport searchid="{387E953D-3539-4D3F-ADE9-273E7CD158DE}"
        linktype="0"><applicant reporttype="0" tpoptout="1" reporttitle="Address not
        found"><creditscore><score class="2">9999</score><reasons><code>0</code><code>0</code><code>0</code><code>0</code></reasons></creditscore></applicant></creditreport></SearchResult></Search07aResponse></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Thu, 25 Jul 2013 08:05:25 GMT
- request:
    method: post
    uri: https://ct.callcreditsecure.co.uk/Services/CallReport/callreport7.asmx
    body:
      encoding: US-ASCII
      string: ! "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"
        xmlns:soap=\"urn:callcredit.co.uk/soap:callreport7\">\n  <soapenv:Header>\n
        \   <soap:callcreditheaders>\n      <soap:company>company</soap:company>\n
        \     <soap:username>username</soap:username>\n      <soap:password>password</soap:password>\n
        \   </soap:callcreditheaders>\n  </soapenv:Header>\n  <soapenv:Body>\n    <soap:Search07a>\n
        \ <soap:SearchDefinition>\n    <soap:creditrequest schemaversion=\"7.0\" datasets=\"255\">\n
        \     <soap:applicant><soap:address>\n  <soap:buildingno>7</soap:buildingno>\n
        \ <soap:postcode>W1</soap:postcode>\n</soap:address><soap:name>\n  <soap:forename>Julia</soap:forename>\n
        \ <soap:surname>Audi</soap:surname>\n</soap:name><soap:dob>1943-03-06</soap:dob><soap:hho>0</soap:hho><soap:tpoptout>1</soap:tpoptout><soap:applicantdemographics>\n
        \ <soap:employment/>\n</soap:applicantdemographics></soap:applicant>\n    <soap:score>1</soap:score><soap:purpose>TV</soap:purpose><soap:autosearch>1</soap:autosearch><soap:autosearchmaximum>3</soap:autosearchmaximum></soap:creditrequest>\n
        \ </soap:SearchDefinition>\n</soap:Search07a>\n  </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Soapaction:
      - ! '"urn:callcredit.co.uk/soap:callreport7/Search07a"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1144'
  response:
    status:
      code: 500
      message: !binary |-
        SW50ZXJuYWwgU2VydmVyIEVycm9y
    headers:
      !binary "RGF0ZQ==":
      - !binary |-
        V2VkLCAwNyBBdWcgMjAxMyAwOToxODoxMyBHTVQ=
      !binary "Q2FjaGUtQ29udHJvbA==":
      - !binary |-
        cHJpdmF0ZQ==
      !binary "Q29udGVudC1UeXBl":
      - !binary |-
        dGV4dC94bWw7IGNoYXJzZXQ9dXRmLTg=
      !binary "Q29ubmVjdGlvbg==":
      - !binary |-
        Y2xvc2U=
      !binary "VHJhbnNmZXItRW5jb2Rpbmc=":
      - !binary |-
        Y2h1bmtlZA==
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0idXRmLTgiPz48c29hcDpF
        bnZlbG9wZSB4bWxuczpzb2FwPSJodHRwOi8vc2NoZW1hcy54bWxzb2FwLm9y
        Zy9zb2FwL2VudmVsb3BlLyIgeG1sbnM6eHNpPSJodHRwOi8vd3d3LnczLm9y
        Zy8yMDAxL1hNTFNjaGVtYS1pbnN0YW5jZSIgeG1sbnM6eHNkPSJodHRwOi8v
        d3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYSI+PHNvYXA6Qm9keT48c29hcDpG
        YXVsdD48ZmF1bHRjb2RlPnNvYXA6Q2xpZW50PC9mYXVsdGNvZGU+PGZhdWx0
        c3RyaW5nPkVycm9yKHMpPC9mYXVsdHN0cmluZz48ZGV0YWlsPjxFcnJvckJs
        b2NrPjxFcnJvcj5Vc2VyIGxvZ29uIGZhaWxlZC4gVXNlciBhY2NvdW50IGNv
        dWxkIG5vdCBiZSBmb3VuZDwvRXJyb3I+PC9FcnJvckJsb2NrPjwvZGV0YWls
        Pjwvc29hcDpGYXVsdD48L3NvYXA6Qm9keT48L3NvYXA6RW52ZWxvcGU+
    http_version:
  recorded_at: Wed, 07 Aug 2013 09:18:14 GMT
recorded_with: VCR 2.5.0
